In [3]:
import numpy as np
import pandas as pd

In [2]:
#series

In [3]:
first=pd.Series(list('abcdef'))
print(first)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [1]:
np_country=np.array(['Sri Lanka','India','Pakistan','Nepal','Bangladesh','Maldives','Afghanistan','Bhutan'])

In [5]:
country_series= pd.Series(np_country)

In [6]:
print(country_series)

0      Sri Lanka
1          India
2       Pakistan
3          Nepal
4     Bangladesh
5       Maldives
6    Afghanistan
7         Bhutan
dtype: object

In [8]:
dict_countryGDP=pd.Series([200,500,100,90,300,350,50,90],index=['Sri Lanka','India','Pakistan','Nepal','Bangladesh','Maldives','Afghanistan','Bhutan'])
print(dict_countryGDP)

Sri Lanka      200
India          500
Pakistan       100
Nepal           90
Bangladesh     300
Maldives       350
Afghanistan     50
Bhutan          90
dtype: int64

In [9]:
scalar_series=pd.Series(5.,index=['a','c','j','g'])
print(scalar_series)

a    5.0
c    5.0
j    5.0
g    5.0
dtype: float64

In [10]:
#access data

In [11]:
dict_countryGDP[2]

100

In [12]:
dict_countryGDP[3:5]

Nepal          90
Bangladesh    300
dtype: int64

In [13]:
dict_countryGDP.loc['Maldives']

350

In [14]:
dict_countryGDP.iloc[1]

500

In [17]:
first_vector_series=pd.Series([1,2,3,4],index=['a','b','c','d'])
second_vector_series=pd.Series([10,20,30,40],index=['a','b','c','d'])

In [18]:
first_vector_series+second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [20]:
third_vector_series=pd.Series([10,20,30,40],index=['a','c','b','d'])

In [21]:
first_vector_series+third_vector_series

a    11
b    32
c    23
d    44
dtype: int64

In [22]:
fourth_vector_series=pd.Series([10,20,30,40],index=['a','b','p','q'])

In [23]:
first_vector_series+fourth_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
p     NaN
q     NaN
dtype: float64

In [24]:
#DataFrames

In [25]:
olympic_list={'HostCity':['London','Beijing','Athens','Sydney','Atlanta'],'Year':[2012,2008,2004,2000,1996],'No of participating countries':[205,204,201,200,197]}

In [26]:
c  #pass list to the data frame

In [27]:
df_olympic

  HostCity  Year  No of participating countries
0   London  2012                            205
1  Beijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197

In [28]:
olympic_data_dict={'London':{2012:205},'Beijing':{2008:204}}  #dataframe from dict

In [29]:
df_olympic_dict=pd.DataFrame(olympic_data_dict)

In [30]:
df_olympic_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [31]:
df_olympic.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [32]:
df_olympic.describe

<bound method NDFrame.describe of   HostCity  Year  No of participating countries
0   London  2012                            205
1  Beijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197>

In [34]:
olympic_participation=pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])

In [35]:
olympic_country=pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],index=[2012,2008,2004,2000,1996])

In [37]:
df_olympic_series=pd.DataFrame({'No of parti':olympic_participation,'Host':olympic_country})  #create df from dict series

In [38]:
df_olympic_series

      No of parti     Host
2012          205   London
2008          204  Beijing
2004          201   Athens
2000          200   Sydney
1996          197  Atlanta

In [39]:
#create df from ndarray

In [40]:
import numpy as np

In [41]:
array1=np.array([2012,2008,2004,2000,1996])
dict_ndarray={'year':array1}

In [42]:
df_array=pd.DataFrame(dict_ndarray)   #pass dict to the data frame

In [43]:
df_array

   year
0  2012
1  2008
2  2004
3  2000
4  1996

In [44]:
#create df from df

In [45]:
df_from_df=pd.DataFrame(df_olympic_series)

In [46]:
df_from_df

      No of parti     Host
2012          205   London
2008          204  Beijing
2004          201   Athens
2000          200   Sydney
1996          197  Atlanta